//public class main1 {
//
//    public static void main(String[] args) {
//        System.out.println("good");
//    }
//}
//
//
///*
//Дан массив двоичных чисел, например [1,1,0,1,1,1],вывести максимальное количество подряд идущих 1.
//*/
//public class main1 {
//
//    public static void main(String[] args) {
//        int count = 0;
//        int[] arr = new int[]{1,1,0,1,1,1};
//
//
//        System.out.println("good");
//    }
//}

/*
         Дан массив nums = [3,2,2,3] и число val = 3.
         Если в массиве есть числа, равные заданному, нужно перенести эти элементы в конец массива.
         Таким образом, первые несколько (или все) элементов массива должны быть отличны от заданного, а остальные - равны ему.
*/


/*
         Напишите метод, который находит самую длинную строку общего префикса среди массива строк.
         Если общего префикса нет, вернуть пустую строку "".
*/


/*
         Во фразе "Добро пожаловать на курс по Java" переставить слова в обратном порядке.
*/


/*
         Реализовать функцию возведения числа а в степень b. a, b из Z. Сводя количество выполняемых действий к минимуму.
         Пример 1: а = 3, b = 2, ответ: 9
         Пример 2: а = 2, b = -2, ответ: 0.25
         Пример 3: а = 3, b = 0, ответ: 1
*/


/*
         Задан массив, например, nums = [1,7,3,6,5,6].
         Написать программу, которая найдет индекс i для этого массива такой, что сумма элементов с индексами < i равна сумме элементов с индексами > i.
*/


/*
         Записать в файл следующие данные:

         Name Surname Age
         Kate Smith 20
         Paul Green 25
         Mike Black 23
*/